## Production: terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                   |
|--------|------------------------------------------|
| add    | `aws_dynamodb_table.sre_bot_idempotency` |
| update | `module.vpc.aws_nat_gateway.nat_gw[0]`   |
|        | `module.vpc.aws_nat_gateway.nat_gw[1]`   |
|        | `module.vpc.aws_nat_gateway.nat_gw[2]`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.sre_bot_idempotency will be created
  + resource "aws_dynamodb_table" "sre_bot_idempotency" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "idempotency_key"
      + id               = (known after apply)
      + name             = "sre_bot_idempotency"
      + read_capacity    = 5
      + region           = "ca-central-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "idempotency_key"
          + type = "S"
        }

      + global_table_witness {
          + region_name = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = (known after apply)
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }

      + warm_throughput {
          + read_units_per_second  = (known after apply)
          + write_units_per_second = (known after apply)
        }
    }

  # module.vpc.aws_nat_gateway.nat_gw[0] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                                 = "nat-0e391b5e2302b362e"
      + regional_nat_gateway_address       = (known after apply)
        tags                               = {
            "CostCentre" = "sre-bot"
            "Name"       = "SREBotVPC-natgw-0"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[1] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                                 = "nat-0a6ae9ec174a0ff21"
      + regional_nat_gateway_address       = (known after apply)
        tags                               = {
            "CostCentre" = "sre-bot"
            "Name"       = "SREBotVPC-natgw-1"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[2] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                                 = "nat-03d11fcf192a3acc6"
      + regional_nat_gateway_address       = (known after apply)
        tags                               = {
            "CostCentre" = "sre-bot"
            "Name"       = "SREBotVPC-natgw-2"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.sre_bot_bucket.aws_s3_bucket.this,
  on .terraform/modules/sre_bot_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.sre_bot_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_backup_plan.sre_bot_backup_plan"]
WARN - plan.json - main - Missing Common Tags: ["aws_backup_vault.sre_bot_backup_vault"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre_bot_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre_bot_waf_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_high_cpu"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_high_memory"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.aws_access_requests_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.incidents_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_idempotency"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.geodb_refresh_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common...
```

</details>
